namespace Episode001_Variables

    /*
     * Переменные в C#
     */


{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Второй цикл уроков для запоминания и повторения!");
            Console.WriteLine("Повторение - Мать учения!!!!");

            int a; // Объявление переменной a
            a = 10; // Присваивание значения переменной a, инициализация переменной a

            // Основные типы переменных в C#
            // Целочисленные типы

            byte b = 255; // 1 байт, от 0 до 255
            sbyte sb = -128; // 1 байт, от -128 до 127
            short s = -32768; // 2 байта, от -32768 до 32767
            ushort us = 65535; // 2 байта, от 0 до 65535
            int i = -2147483648; // 4 байта, от -2147483648 до 2147483647
            uint ui = 4294967295; // 4 байта, от 0 до 4294967295
            long l = -9223372036854775808; // 8 байт, от -9223372036854775808 до 9223372036854775807
            ulong ul = 18446744073709551615; // 8 байт, от 0 до 18446744073709551615

            // Вещественные типы
            float f = 3.40282347E+38F; // 4 байта, от -3.40282347E+38 до 3.40282347E+38
            double d = 1.7976931348623157E+308; // 8 байт, от -1.7976931348623157E+308 до 1.7976931348623157E+308
            decimal dec = 79228162514264337593543950335M; // 16 байт, от -79228162514264337593543950335 до 792281625142

            // Символьный тип
            char c = 'A'; // 2 байта, символ Unicode

            // Логический тип
            bool isTrue = true; // 1 байт, true или false

            // В Unity как правило используются следующие типы: int, float, bool, string

            // Время 21 минута


            








        }

    }
}
